app/Models/AtendimentoModel.php

UPDATE `contador` SET `numero` = 220
WHERE `servico_id` = '3'
AND `unidade_id` = '1'
---
public function updatecontador($numero,$id_servico,$id_unidade){

$db      = \Config\Database::connect();
$builder = $db->table('contador');
$builder->set('numero',$numero, false);
$builder->where('servico_id',$id_servico)->where('unidade_id',$id_unidade);
$builder->update();